In [2]:
import pandas as pd
df = pd.DataFrame({
    'A': [1, 88, 3,10,7,0,88],
    'B': [4, 5, 55,6,8,9,20]
})
df

    A   B
0   1   4
1  88   5
2   3  55
3  10   6
4   7   8
5   0   9
6  88  20

In [21]:
#smallest 3 number in A column 
df.nsmallest(n=3,columns = ['A'])

   A   B
5  0   9
0  1   4
2  3  55

In [23]:
#smallest 3 number in A column 
df.nsmallest(n=3,columns = 'A')

   A   B
5  0   9
0  1   4
2  3  55

In [25]:
# Get the top 3 rows with the smallest values in column 'A',
#and in case of ties, sort by 'B'
df.nsmallest(n=3,columns = ['A','B'])

   A   B
5  0   9
0  1   4
2  3  55

In [16]:
df.nsmallest(n=3,columns = ['A'], keep='last')

   A   B
5  0   9
0  1   4
2  3  55

In [19]:
df.nsmallest(n=3,columns = ['A'], keep='all')

   A   B
5  0   9
0  1   4
2  3  55